Task 1

In [1]:
import pandas as pd

In [123]:
# Fetch the data from the data file

fully_df = pd.read_csv('online_store_customer_data.csv')

shape = fully_df.shape
shape

(2512, 11)

In [124]:
#Full description 

df_description =  fully_df.describe()
df_description

       Transaction_ID          Age      Referal  Amount_spent
count     2512.000000  2470.000000  2357.000000   2270.000000
mean    152443.931131    46.637652     0.652100   1418.422577
std        724.580482    18.186277     0.476405    878.507451
min     151200.000000    15.000000     0.000000      2.090000
25%     151815.750000    32.000000     0.000000    678.192500
50%     152443.500000    47.000000     1.000000   1341.435000
75%     153071.250000    62.000000     1.000000   2038.102500
max     153699.000000    78.000000     1.000000   2999.980000

In [125]:
# Finding colum and their data types in data base

file_info = fully_df.info()
file_info

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2512 entries, 0 to 2511
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction_date  2512 non-null   object
 1   Transaction_ID    2512 non-null   int64
 2   Gender            2484 non-null   object
 3   Age               2470 non-null   float64
 4   Marital_status    2512 non-null   object
 5   State_names       2512 non-null   object
 6   Segment           2512 non-null   object
 7   Employees_status  2486 non-null   object
 8   Payment_method    2512 non-null   object
 9   Referal           2357 non-null   float64
 10  Amount_spent      2270 non-null   float64
dtypes: float64(3), int64(1), object(7)
memory usage: 216.0+ KB

In [126]:
#Use function value_counts() to find out unique values and their frequency in columns Sex, Marital_status, and Payement_method.

df_value = fully_df[['Gender' , 'Marital_status' , 'Payment_method']].value_counts()
df_value

Gender  Marital_status  Payment_method
Female  Married         PayPal            359
Male    Married         PayPal            303
Female  Single          PayPal            255
        Married         Card              243
Male    Single          PayPal            239
        Married         Card              193
Female  Married         Other             186
        Single          Card              186
Male    Married         Other             172
Female  Single          Other             127
Male    Single          Card              117
                        Other             104
Name: count, dtype: int64

    # Task 2: Find missing values in your dataset. 

• Use function isna() to find missing values. 
• Use function isnull() to find missing values. 
• What’s the difference between isna() and isnull()? Google it!!!

In [127]:
# using function insa to find missing values

find_missing_values = fully_df.isna().sum()
find_missing_values

Transaction_date      0
Transaction_ID        0
Gender               28
Age                  42
Marital_status        0
State_names           0
Segment               0
Employees_status     26
Payment_method        0
Referal             155
Amount_spent        242
dtype: int64

In [128]:
# Use function isnull() to find missing values. 

find_missing_values_null = fully_df.isnull().sum()
find_missing_values_null

Transaction_date      0
Transaction_ID        0
Gender               28
Age                  42
Marital_status        0
State_names           0
Segment               0
Employees_status     26
Payment_method        0
Referal             155
Amount_spent        242
dtype: int64

 
# Task 3: Handle missing values in your dataset. 
Handling missing values in the common task in the data pre-processing part. For many reasons most 
of the time we will encounter missing values. Without dealing with this we can't do the proper 
model building. You have already find out the missing value count in Task 2. Now, we decided how to 
handle them. We can handle this by removing affected columns or rows or replacing appropriate 
values there. 
Remove Columns: If there are a lot of values missing a column then it’s a good idea to drop/delete 
that column.  
Drop column “Amount_spent” using df.drop(columns=[‘column name’], inplace=True) 
Or  
df.drop(‘column name', axis=1, inplace=True) 
 
Remove Rows: If there are more missing values then it is better to remove rows.  
Remove rows from data frame where Employee_status values are missing.  
df.dropna(subset = ["Employees_status"], inplace=True)

In [129]:
# Dropping Colum 

temp_df = fully_df.drop(columns=['Amount_spent'],axis=1)
temp_df

,Transaction_date,Transaction_ID,Gender,Age,Marital_status,State_names,Segment,Employees_status,Payment_method,Referal
0,1/1/2019,151200,Female,19.0,Single,Kansas,Basic,Unemployment,Other,1.0
1,1/1/2019,151201,Male,49.0,Single,Illinois,Basic,self-employed,Card,0.0
2,1/1/2019,151202,Male,63.0,Married,New Mexico,Basic,workers,PayPal,1.0
3,1/1/2019,151203,NaN,18.0,Single,Virginia,Platinum,workers,Card,1.0
4,1/1/2019,151204,Male,27.0,Single,Connecticut,Basic,self-employed,Card,0.0
...,...,...,...,...,...,...,...,...,...,...
2507,5/1/2021,153695,Female,57.0,Single,South Carolina,Platinum,self-employed,Card,0.0
2508,5/1/2021,153696,Female,36.0,Married,Hawaii,Silver,self-employed,PayPal,1.0
2509,5/1/2021,153697,Male,22.0,Single,South Carolina,Basic,workers,PayPal,1.0
2510,5/1/2021,153698,NaN,44.0,Single,New York,Basic,Employees,PayPal,0.0
2511,5/1/2021,153699,Male,48.0,Single,California,Silver,workers,PayPal,1.0

In [130]:
# Dropping data now

fully_df = pd.read_csv('online_store_customer_data.csv')

temp_df = fully_df.dropna(subset=['Employees_status'])
temp_df

,Transaction_date,Transaction_ID,Gender,Age,Marital_status,State_names,Segment,Employees_status,Payment_method,Referal,Amount_spent
0,1/1/2019,151200,Female,19.0,Single,Kansas,Basic,Unemployment,Other,1.0,2051.36
1,1/1/2019,151201,Male,49.0,Single,Illinois,Basic,self-employed,Card,0.0,544.04
2,1/1/2019,151202,Male,63.0,Married,New Mexico,Basic,workers,PayPal,1.0,1572.60
3,1/1/2019,151203,NaN,18.0,Single,Virginia,Platinum,workers,Card,1.0,1199.79
4,1/1/2019,151204,Male,27.0,Single,Connecticut,Basic,self-employed,Card,0.0,NaN
...,...,...,...,...,...,...,...,...,...,...,...
2507,5/1/2021,153695,Female,57.0,Single,South Carolina,Platinum,self-employed,Card,0.0,150.10
2508,5/1/2021,153696,Female,36.0,Married,Hawaii,Silver,self-employed,PayPal,1.0,708.88
2509,5/1/2021,153697,Male,22.0,Single,South Carolina,Basic,workers,PayPal,1.0,2030.07
2510,5/1/2021,153698,NaN,44.0,Single,New York,Basic,Employees,PayPal,0.0,1909.77
2511,5/1/2021,153699,Male,48.0,Single,California,Silver,workers,PayPal,1.0,1073.15

# Impute/Replace Missing Values: Most of the time, we can’t afford to delete rows or columns.
It’s always better to replace missing values rather than deleting data. We will learn how to replace 
missing values for both numeric and categorical features. 
a) Numeric: For numerical features, we can replace the missing values with 0 or mean value. 
Replace Amount_spent missing values with the mean value of amount_spent. 
• First find the mean value of column “Amount_spent”. 
mean_amount_spent = df['Amount_spent'].mean() 
• Replace the missing value by using function fillna. 
  df['Amount_spent'].fillna(mean_amount_spent, inplace=True) 
• Try your code to replace missing values in Age with the mean age value

In [131]:
fully_df = pd.read_csv('online_store_customer_data.csv')

means_values = fully_df['Amount_spent'].mean()
means_values

1418.4225770925111

In [132]:
#Replace the missing value by using function fillna.


temp_df = fully_df['Amount_spent'].fillna(means_values)
temp_df

0       2051.360000
1        544.040000
2       1572.600000
3       1199.790000
4       1418.422577
           ...
2507     150.100000
2508     708.880000
2509    2030.070000
2510    1909.770000
2511    1073.150000
Name: Amount_spent, Length: 2512, dtype: float64

In [133]:
# mean age

temp_df = fully_df['Age'].mean()
temp_df

46.63765182186235

In [134]:
# Replacing empty places with mean

temp_df = fully_df['Age'].fillna(means_values)
temp_df

0       19.0
1       49.0
2       63.0
3       18.0
4       27.0
        ...
2507    57.0
2508    36.0
2509    22.0
2510    44.0
2511    48.0
Name: Age, Length: 2512, dtype: float64

# b) Categorical Features: 
 
• Missing values in Categorical Features could be replace with either ‘Unknown’ or mode 
value. 
• Replace missing values in “Employee_status” with the mode value of the column 
“Employee_status”. 
First find the mode value using function mode. 
# Impute Mode in Employees_status column 
mode_emp = df['Employees_status'].mode().iloc[0] 
 
NOTE: If there are multiple mode values, df['Employees_status'].mode() will return a Series 
containing all the mode values. Using iloc[0] ensures that you're selecting the first value from 
this Series, which avoids an error. This is because pandas expects a single scalar value for 
replacing missing data, not a list or Series. 
 
Replace missing values with mode value using function fillna() 
df['Employees_status'].fillna(mode_emp, inplace=True) 
 
• Try your code to replace the missing values in Gender.

In [135]:
mode_emp = fully_df['Employees_status'].mode().iloc[0]
mode_emp

'Employees'

In [137]:
temp = fully_df['Employees_status'].fillna(mode_emp)
temp

0        Unemployment
1       self-employed
2             workers
3             workers
4       self-employed
            ...
2507    self-employed
2508    self-employed
2509          workers
2510        Employees
2511          workers
Name: Employees_status, Length: 2512, dtype: object

In [139]:
mode_emp = fully_df['Gender'].mode().iloc[0]
mode_emp

'Female'

In [140]:
# Gender mode
temp = fully_df['Gender'].fillna(mode_emp)
temp

0       Female
1         Male
2         Male
3       Female
4         Male
         ...
2507    Female
2508    Female
2509      Male
2510    Female
2511      Male
Name: Gender, Length: 2512, dtype: object